rest-1c-server/src/Documents/Накладная/Накладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Накладная</name>
  <registerRecords>AccumulationRegister.ТоварНаСкладе</registerRecords>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

rest-1c-server/src/AccumulationRegisters/ТоварНаСкладе/ТоварНаСкладе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварНаСкладе</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

rest-1c-server/src/Documents/Накладная/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Для Каждого Строка из Товары Цикл
		
		НовДвижение = Движения.ТоварНаСкладе.Добавить();
		НовДвижение.Номенклатура = Строка.Номенклатура;
		НовДвижение.ВидДвижения = ВидДвиженияНакопления.Приход;
		НовДвижение.Регистратор = Ссылка;
		НовДвижение.Период = ТекущаяДата();
			
	КонецЦикла;
	
	
	
	Движения.ТоварНаСкладе.Записывать = Истина;
	Движения.ТоварНаСкладе.БлокироватьДляИзменения = Истина;	
	Движения.Записать();
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварНаСкладеОстатки.Номенклатура КАК Номенклатура,
	               |	ТоварНаСкладеОстатки.КоличествоОстаток КАК КоличествоОстаток
	               |ИЗ
	               |	РегистрНакопления.ТоварНаСкладе.Остатки КАК ТоварНаСкладеОстатки";
	Выб = Запрос.Выполнить().Выбрать();
	Пока  Выб.Следующий() Цикл
	КонецЦикла;
	
	
КонецПроцедуры
